from random import choice
from collections import Counter


class Dice:
    def __init__(self):
        self.throws = (1, 2, 3, 4, 5, 6)

    def throw(self):
        return choice(self.throws)

    def __str__(self):
        return "simple_dice"


class Even_Dice(Dice):
    """Кубик, четные грани которого отмечены маленькими точками. Что же это может значить?
        Вероятность выпадения 1: 13,3 %
        Вероятность выпадения 2: 0,200 %
        Вероятность выпадения 3: 0,133 %
        Вероятность выпадения 4: 0,200 %
        Вероятность выпадения 5: 0,133 %
        Вероятность выпадения 6: 0,200 %
        """

    def __init__(self):
        self.throws = (1, 1, 2, 2, 2, 3, 3, 4, 4, 4, 5, 5, 6, 6, 6) # 15 вариантов

    def __str__(self):
        return "odd_dice"


class Three_Dice(Dice):
    """Кубик, который, если верить слухам, был освещен самим Патриархом Кириллом. А может, он просто с грузиком.
        Вероятность выпадения 1: 0,125 %
        Вероятность выпадения 2: 0,125 %
        Вероятность выпадения 3: 0,375 %
        Вероятность выпадения 4: 0,125 %
        Вероятность выпадения 5: 0,125 %
        Вероятность выпадения 6: 0,125 %
        """

    def __init__(self):
        self.throws = (1, 2, 3, 3, 3, 4, 5, 6) # 8 вариантов

    def __str__(self):
        return "three_dice"


class Heavy_Dice(Dice):
    """Кубик выглядит, как обычная кость, но просто немножко тяжелее.
        Вероятность выпадения 1: 0,235 %
        Вероятность выпадения 2: 0,176 %
        Вероятность выпадения 3: 0,176 %
        Вероятность выпадения 4: 0,176 %
        Вероятность выпадения 5: 0,176 %
        Вероятность выпадения 6: 0,059 %
        """

    def __init__(self):
        self.throws = (1, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5, 6)  # 17 вариантов

    def __str__(self):
        return "heavy_dice"


class Evil_Dice(Dice):
    """Животное продало душу за победу в обыном бросании кубиков, и теперь имеет повышенную вероятность выпадения
        гарантировано приносящего очки кубика.
        Вероятность выпадения 1: 0,250 %
        Вероятность выпадения 2: 0,143 %
        Вероятность выпадения 3: 0,143 %
        Вероятность выпадения 4: 0,143 %
        Вероятность выпадения 5: 0,250 %
        Вероятность выпадения 6: 0,143 %
        """

    def __init__(self):
        self.throws = (1, 1, 2, 3, 4, 5, 5, 6)  # 8 вариантов
    def __str__(self):
        return "evil_dice"



dice =
c = Counter([])
