from random import choice
from collections import Counter


class Dice:
    """\"Обычная белая игральная кость. Никакого подвоха!\"

    Вероятность выпадения 1: 16,7 %
    Вероятность выпадения 2: 16,7 %
    Вероятность выпадения 3: 16,7 %
    Вероятность выпадения 4: 16,7 %
    Вероятность выпадения 5: 16,7 %
    Вероятность выпадения 6: 16,7 %
        """
    def __init__(self):
        self.throws = (1, 2, 3, 4, 5, 6)  # 6 вариантов

    def throw(self):
        return choice(self.throws)

    def __str__(self):
        return "simple_dice"


class Even_Dice(Dice):
    """\"Кубик, четные грани которого отмечены маленькими точками. Что же это может значить?\"

    Вероятность выпадения 1: 13,3 %
    Вероятность выпадения 2: 20,0 %
    Вероятность выпадения 3: 13,3 %
    Вероятность выпадения 4: 20,0 %
    Вероятность выпадения 5: 13,3 %
    Вероятность выпадения 6: 20,0 %
        """

    def __init__(self):
        self.throws = (1, 1, 2, 2, 2, 3, 3, 4, 4, 4, 5, 5, 6, 6, 6) # 15 вариантов

    def __str__(self):
        return "odd_dice"


class Three_Dice(Dice):
    """\"Кубик, который, если верить слухам, был освещен самим Патриархом Кириллом. А может, он просто с грузиком.\"

    Вероятность выпадения 1: 12,5 %
    Вероятность выпадения 2: 12,5 %
    Вероятность выпадения 3: 37,5 %
    Вероятность выпадения 4: 12,5 %
    Вероятность выпадения 5: 12,5 %
    Вероятность выпадения 6: 12,5 %
        """

    def __init__(self):
        self.throws = (1, 2, 3, 3, 3, 4, 5, 6) # 8 вариантов

    def __str__(self):
        return "three_dice"


class Heavy_Dice(Dice):
    """\"Кубик выглядит, как обычная кость, но просто немножко тяжелее.\"

    Вероятность выпадения 1: 23,5 %
    Вероятность выпадения 2: 17,6 %
    Вероятность выпадения 3: 17,6 %
    Вероятность выпадения 4: 17,6 %
    Вероятность выпадения 5: 17,6 %
    Вероятность выпадения 6:  5,9 %
        """

    def __init__(self):
        self.throws = (1, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5, 6)  # 17 вариантов

    def __str__(self):
        return "heavy_dice"


class Evil_Dice(Dice):
    """ \"Животное продало душу за победу в обыном бросании кубиков,
  и теперь имеет повышенную вероятность выпадения гарантировано приносящего очки кубика.\"

    Вероятность выпадения 1: 25,0 %
    Вероятность выпадения 2: 14,3 %
    Вероятность выпадения 3: 14,3 %
    Вероятность выпадения 4: 14,3 %
    Вероятность выпадения 5: 25,0 %
    Вероятность выпадения 6: 14,3 %
        """

    def __init__(self):
        self.throws = (1, 1, 2, 3, 4, 5, 5, 6)  # 8 вариантов

    def __str__(self):
        return "evil_dice"



#dice = Evil_Dice
#print(dice.__doc__)
